logs/scenario13_20250613_192001.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/scenario13_basic_chat_completion.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 5 VUs  0m01.0s/2m0s
time="2025-06-13T19:20:04Z" level=info msg="[DEBUG 2025-06-13T19:20:04.618Z] Starting chat completion with model: gpt-4o-mini" source=console
time="2025-06-13T19:20:05Z" level=info msg="[DEBUG 2025-06-13T19:20:05.084Z] Starting chat completion with model: gpt-4o-mini" source=console
time="2025-06-13T19:20:05Z" level=info msg="[DEBUG 2025-06-13T19:20:05.092Z] Starting chat completion with model: gpt-4o" source=console

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m02.0s/2m0s
time="2025-06-13T19:20:05Z" level=info msg="[DEBUG 2025-06-13T19:20:05.724Z] Starting chat completion with model: gpt-4o" source=console
time="2025-06-13T19:20:05Z" level=info msg="[DEBUG 2025-06-13T19:20:05.770Z] Starting chat completion with model: gpt-4o-mini" source=console

running (0m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m03.0s/2m0s

running (0m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m04.0s/2m0s

running (0m05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 5 VUs  0m05.0s/2m0s

running (0m06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m06.0s/2m0s

running (0m07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  0m07.0s/2m0s

running (0m08.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m08.0s/2m0s

running (0m09.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m09.0s/2m0s

running (0m10.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m10.0s/2m0s

running (0m11.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  0m11.0s/2m0s

running (0m12.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m12.0s/2m0s

running (0m15.9s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 5 VUs  0m13.0s/2m0s

running (0m16.9s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m14.0s/2m0s
time="2025-06-13T19:20:20Z" level=info msg="[DEBUG 2025-06-13T19:20:20.920Z] Chat completion successful for model gpt-4o-mini, took 16302ms" source=console

running (0m17.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m15.0s/2m0s
time="2025-06-13T19:20:22Z" level=info msg="[DEBUG 2025-06-13T19:20:22.329Z] Starting chat completion with model: gpt-4o" source=console

running (0m18.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m16.0s/2m0s

running (0m19.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  14% ] 5 VUs  0m17.0s/2m0s

running (0m20.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m18.0s/2m0s

running (0m21.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  0m19.0s/2m0s

running (0m22.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m20.0s/2m0s

running (0m23.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m21.0s/2m0s

running (0m24.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m22.0s/2m0s

running (0m25.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  0m23.0s/2m0s

running (0m26.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  0m24.0s/2m0s

running (0m27.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  0m25.0s/2m0s

running (0m28.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  0m26.0s/2m0s

running (0m29.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  0m27.0s/2m0s

running (0m30.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  0m28.0s/2m0s

running (0m31.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  24% ] 5 VUs  0m29.0s/2m0s

running (0m32.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  0m30.0s/2m0s

running (0m33.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  0m31.0s/2m0s

running (0m34.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  0m32.0s/2m0s

running (0m35.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  0m33.0s/2m0s

running (0m36.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  0m34.0s/2m0s

running (0m37.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  0m35.0s/2m0s

running (0m38.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  0m36.0s/2m0s

running (0m39.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  31% ] 5 VUs  0m37.0s/2m0s

running (0m40.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  0m38.0s/2m0s

running (0m41.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  0m39.0s/2m0s

running (0m42.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  0m40.0s/2m0s

running (0m43.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  0m41.0s/2m0s

running (0m44.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  0m42.0s/2m0s

running (0m45.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  0m43.0s/2m0s

running (0m46.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  0m44.0s/2m0s

running (0m50.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  0m45.0s/2m0s

running (0m51.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  0m46.0s/2m0s

running (0m52.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  0m47.0s/2m0s

running (0m53.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  0m48.0s/2m0s

running (0m54.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  41% ] 5 VUs  0m49.0s/2m0s

running (0m55.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  0m50.0s/2m0s

running (0m56.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  0m51.0s/2m0s

running (0m57.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  0m52.0s/2m0s

running (0m58.9s), 5/5 VUs, 1 complete and 0 interrupted iterations
default   [  44% ] 5 VUs  0m53.0s/2m0s
time="2025-06-13T19:21:03Z" level=info msg="[DEBUG 2025-06-13T19:21:03.027Z] Chat completion successful for model gpt-4o, took 57935ms" source=console
time="2025-06-13T19:21:03Z" level=info msg="[DEBUG 2025-06-13T19:21:03.027Z] Chat completion successful for model gpt-4o-mini, took 57942ms" source=console
time="2025-06-13T19:21:03Z" level=info msg="[DEBUG 2025-06-13T19:21:03.191Z] Chat completion successful for model gpt-4o, took 57467ms" source=console
time="2025-06-13T19:21:03Z" level=info msg="[DEBUG 2025-06-13T19:21:03.191Z] Chat completion successful for model gpt-4o-mini, took 57420ms" source=console

running (0m59.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  0m54.0s/2m0s
time="2025-06-13T19:21:04Z" level=info msg="[DEBUG 2025-06-13T19:21:04.119Z] Starting chat completion with model: gpt-4o" source=console
time="2025-06-13T19:21:04Z" level=info msg="[DEBUG 2025-06-13T19:21:04.205Z] Starting chat completion with model: gpt-4o" source=console

running (1m00.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  0m55.0s/2m0s
time="2025-06-13T19:21:04Z" level=info msg="[DEBUG 2025-06-13T19:21:04.427Z] Starting chat completion with model: gpt-4o" source=console

running (1m01.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  0m56.0s/2m0s
time="2025-06-13T19:21:05Z" level=info msg="[DEBUG 2025-06-13T19:21:05.684Z] Starting chat completion with model: gpt-4o-mini" source=console

running (1m02.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  0m57.0s/2m0s

running (1m03.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  0m58.0s/2m0s

running (1m04.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  0m59.0s/2m0s

running (1m05.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  1m00.0s/2m0s

running (1m06.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  51% ] 5 VUs  1m01.0s/2m0s

running (1m07.9s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  1m02.0s/2m0s
time="2025-06-13T19:21:12Z" level=info msg="[DEBUG 2025-06-13T19:21:12.091Z] Chat completion successful for model gpt-4o, took 49762ms" source=console

running (1m08.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  1m03.0s/2m0s

running (1m09.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  1m04.0s/2m0s
time="2025-06-13T19:21:14Z" level=info msg="[DEBUG 2025-06-13T19:21:14.214Z] Starting chat completion with model: gpt-4o" source=console

running (1m10.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  54% ] 5 VUs  1m05.0s/2m0s

running (1m11.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  1m06.0s/2m0s

running (1m12.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  1m07.0s/2m0s

running (1m13.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  1m08.0s/2m0s

running (1m14.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  1m09.0s/2m0s

running (1m15.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  1m10.0s/2m0s

running (1m16.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  1m11.0s/2m0s

running (1m17.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  1m12.0s/2m0s

running (1m18.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  61% ] 5 VUs  1m13.0s/2m0s

running (1m19.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  1m14.0s/2m0s

running (1m20.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  1m15.0s/2m0s

running (1m21.9s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  1m16.0s/2m0s

running (1m25.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  64% ] 5 VUs  1m17.0s/2m0s

running (1m26.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  1m18.0s/2m0s

running (1m27.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  1m19.0s/2m0s

running (1m28.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  1m20.0s/2m0s

running (1m29.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  1m21.0s/2m0s

running (1m30.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  1m22.0s/2m0s

running (1m31.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  1m23.0s/2m0s

running (1m32.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  1m24.0s/2m0s

running (1m33.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  71% ] 5 VUs  1m25.0s/2m0s

running (1m34.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  1m26.0s/2m0s

running (1m35.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  1m27.0s/2m0s

running (1m36.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  1m28.0s/2m0s

running (1m37.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  74% ] 5 VUs  1m29.0s/2m0s

running (1m38.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  1m30.0s/2m0s

running (1m39.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  1m31.0s/2m0s

running (1m40.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  1m32.0s/2m0s

running (1m41.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  1m33.0s/2m0s

running (1m42.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  1m34.0s/2m0s

running (1m43.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  1m35.0s/2m0s

running (1m44.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  1m36.0s/2m0s

running (1m45.8s), 5/5 VUs, 6 complete and 0 interrupted iterations
default   [  81% ] 5 VUs  1m37.0s/2m0s
time="2025-06-13T19:21:50Z" level=info msg="[DEBUG 2025-06-13T19:21:50.090Z] Chat completion successful for model gpt-4o, took 45971ms" source=console

running (1m46.8s), 5/5 VUs, 7 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  1m38.0s/2m0s
time="2025-06-13T19:21:50Z" level=info msg="[DEBUG 2025-06-13T19:21:50.287Z] Chat completion successful for model gpt-4o-mini, took 44602ms" source=console
time="2025-06-13T19:21:50Z" level=info msg="[DEBUG 2025-06-13T19:21:50.287Z] Chat completion successful for model gpt-4o, took 46081ms" source=console
time="2025-06-13T19:21:50Z" level=info msg="[DEBUG 2025-06-13T19:21:50.290Z] Chat completion successful for model gpt-4o, took 45862ms" source=console

running (1m47.8s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  1m39.0s/2m0s
time="2025-06-13T19:21:51Z" level=info msg="[DEBUG 2025-06-13T19:21:51.638Z] Starting chat completion with model: gpt-4o" source=console

running (1m48.8s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  1m40.0s/2m0s
time="2025-06-13T19:21:52Z" level=info msg="[DEBUG 2025-06-13T19:21:52.757Z] Starting chat completion with model: gpt-4o-mini" source=console
time="2025-06-13T19:21:52Z" level=info msg="[DEBUG 2025-06-13T19:21:52.808Z] Starting chat completion with model: gpt-4o-mini" source=console
time="2025-06-13T19:21:53Z" level=info msg="[DEBUG 2025-06-13T19:21:53.127Z] Starting chat completion with model: gpt-4o" source=console

running (1m49.8s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  84% ] 5 VUs  1m41.0s/2m0s

running (1m50.8s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  1m42.0s/2m0s

running (1m51.8s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  1m43.0s/2m0s

running (1m52.8s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  1m44.0s/2m0s
time="2025-06-13T19:21:56Z" level=info msg="[DEBUG 2025-06-13T19:21:56.657Z] Chat completion successful for model gpt-4o, took 42443ms" source=console

running (1m53.8s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  1m45.0s/2m0s

running (1m54.8s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  1m46.0s/2m0s
time="2025-06-13T19:21:58Z" level=info msg="[DEBUG 2025-06-13T19:21:58.610Z] Starting chat completion with model: gpt-4o-mini" source=console

running (1m55.8s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  1m47.0s/2m0s

running (1m56.8s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  1m48.0s/2m0s

running (1m57.8s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  91% ] 5 VUs  1m49.0s/2m0s

running (2m01.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  1m50.0s/2m0s

running (2m02.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  1m51.0s/2m0s

running (2m03.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  1m52.0s/2m0s

running (2m04.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  94% ] 5 VUs  1m53.0s/2m0s

running (2m05.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  1m54.0s/2m0s

running (2m06.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  1m55.0s/2m0s

running (2m07.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  1m56.0s/2m0s

running (2m08.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  1m57.0s/2m0s

running (2m09.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  1m58.0s/2m0s

running (2m10.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  1m59.0s/2m0s

running (2m11.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  2m00.0s/2m0s

running (2m12.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m13.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m14.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m15.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m16.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m17.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m18.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m19.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m20.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m21.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m22.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m23.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m24.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m25.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m26.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m27.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m28.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m29.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m30.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m31.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m32.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m36.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m37.7s), 5/5 VUs, 11 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s
time="2025-06-13T19:22:42Z" level=info msg="[DEBUG 2025-06-13T19:22:42.018Z] Chat completion successful for model gpt-4o, took 50380ms" source=console
time="2025-06-13T19:22:42Z" level=info msg="[DEBUG 2025-06-13T19:22:42.046Z] Chat completion successful for model gpt-4o-mini, took 49288ms" source=console
time="2025-06-13T19:22:42Z" level=info msg="[DEBUG 2025-06-13T19:22:42.052Z] Chat completion successful for model gpt-4o-mini, took 49244ms" source=console

running (2m38.7s), 2/5 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s
time="2025-06-13T19:22:42Z" level=info msg="[DEBUG 2025-06-13T19:22:42.177Z] Chat completion successful for model gpt-4o, took 49050ms" source=console

running (2m39.7s), 1/5 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m40.7s), 1/5 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m41.7s), 1/5 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m42.7s), 1/5 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m43.7s), 1/5 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s

running (2m44.7s), 1/5 VUs, 15 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  2m0s


  █ THRESHOLDS 

    chat_response_time
    ✗ 'p(95)<5000' p(95)=57937.1

    chat_success_rate
    ✓ 'rate>0.95' rate=100.00%

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    CUSTOM
    chat_messages_processed.................................................: 15      0.091083/s
    chat_response_time......................................................: avg=47983.266667 min=16302        med=49244        max=57942       p(90)=57747.8      p(95)=57937.1      p(99)=57941.02    
    chat_success_rate.......................................................: 100.00% 15 out of 15
    chat_tokens_generated...................................................: 8353    50.720904/s
    connection_time.........................................................: avg=0.179764     min=0            med=0            max=1.237204    p(90)=0.47378      p(95)=0.708248     p(99)=1.131413    
    time_to_first_byte......................................................: avg=47970.255702 min=16298.979206 med=49240.000907 max=57938.17606 p(90)=57744.214895 p(95)=57933.834496 p(99)=57937.307747

    HTTP
    http_req_duration.......................................................: avg=47.98s       min=16.3s        med=49.24s       max=57.94s      p(90)=57.74s       p(95)=57.93s       p(99)=57.93s      
      { expected_response:true }............................................: avg=47.98s       min=16.3s        med=49.24s       max=57.94s      p(90)=57.74s       p(95)=57.93s       p(99)=57.93s      
    http_req_failed.........................................................: 0.00%   0 out of 15
    http_reqs...............................................................: 15      0.091083/s

    EXECUTION
    iteration_duration......................................................: avg=45.35s       min=14.57s       med=45.87s       max=53.91s      p(90)=53.84s       p(95)=53.91s       p(99)=53.91s      
    iterations..............................................................: 15      0.091083/s
    vus.....................................................................: 1       min=1        max=5
    vus_max.................................................................: 5       min=5        max=5

    NETWORK
    data_received...........................................................: 40 kB   240 B/s
    data_sent...............................................................: 8.0 kB  49 B/s



running (2m44.7s), 0/5 VUs, 15 complete and 1 interrupted iterations
default ✓ [ 100% ] 5 VUs  2m0s
time="2025-06-13T19:22:48Z" level=error msg="thresholds on metrics 'chat_response_time' have been crossed"